Repository: realricardomachado/hybrsoft
Catalog: Hybrsoft.EnterpriseManager/Strings/*/Errors.resw
Source language: en_us
Languages: pt_br

# AppLogListViewModel_ErrorDeleting0Logs1
source: Error deleting {0} Logs: {1}
pt_br: Erro ao excluir {0} Logs: {1}

# AppLogDetailsViewModel_ErrorDeletingLog0
source: Error deleting log: {0}
pt_br: Erro ao excluir o log: {0}

# PermissionListViewModel_ErrorLoadingPermissions0
source: Error loading Permissions: {0}
pt_br: Erro ao carregar Permissões: {0}

# PermissionListViewModel_ErrorDeleting0Permissions1
source: Error deleting {0} Permissions: {1}
pt_br: Erro ao excluir {0} Permissões: {1}

source: Delete not allowed
pt_br: Exclusão não permitida

# PermissionListViewModel_DeselectThe0Permission
source: Deselect the {0} permission!
pt_br: Desmarque a permissão {0}!

# PermissionDetailsViewModel_ErrorSavingPermission0
source: Error saving Permission: {0}
pt_br: Erro ao salvar Permissão: {0}

# PermissionDetailsViewModel_ErrorDeletingPermission0
source: Error deleting Permission: {0}
pt_br: Erro ao excluir Permissão: {0}

# RoleListViewModel_ErrorLoadingRoles0
source: Error loading Roles: {0}
pt_br: Erro ao carregar Funções: {0}

# RoleListViewModel_ErrorDeleting0Roles1
source: Error deleting {0} Roles: {1}
pt_br: Erro ao excluir {0} Funções: {1}

# RolePermissionListViewModel_ErrorLoadingRolePermissions0
source: Error loading Role Permissions: {0}
pt_br: Erro ao carregar Permissões de Função: {0}

# RolePermissionListViewModel_ErrorDeleting0RolePermissions1
source: Error deleting {0} Role Permissions: {1}
pt_br: Erro ao excluir {0} Permissões de Função: {1}

# RoleDetailsViewModel_ErrorSavingRole0
source: Error saving Role: {0}
pt_br: Erro ao salvar Função: {0}

# RoleDetailsViewModel_ErrorDeletingRole0
source: Error deleting Role: {0}
pt_br: Erro ao excluir Função: {0}

# RolePermissionDetailsViewModel_ErrorSavingRolePermission0
source: Error saving Role Permission: {0}
pt_br: Erro ao salvar Permissão de Função: {0}

# RolePermissionDetailsViewModel_ErrorDeletingRolePermission0
source: Error deleting Role Permission: {0}
pt_br: Erro ao excluir Permissão de Função: {0}

# UserListViewModel_ErrorLoadingUsers0
source: Error loading Users: {0}
pt_br: Erro ao carregar Usuários: {0}

# UserListViewModel_ErrorDeleting0Users1
source: Error deleting {0} Users: {1}
pt_br: Erro ao excluir {0} Usuários: {1}

# UserRoleListViewModel_ErrorLoadingUserRoles0
source: Error loading User Roles: {0}
pt_br: Erro ao carregar Funções de Usuário: {0}

# UserRoleListViewModel_ErrorDeleting0UserRoles1
source: Error deleting {0} User Roles: {1}
pt_br: Erro ao excluir {0} Funções de Usuário: {1}

# UserDetailsViewModel_ErrorSavingUser0
source: Error saving User: {0}
pt_br: Erro ao salvar Usuário: {0}

# UserDetailsViewModel_ErrorDeletingUser0
source: Error deleting User: {0}
pt_br: Erro ao excluir Usuário: {0}

# UserRoleDetailsViewModel_ErrorSavingUserRole0
source: Error saving User Role: {0}
pt_br: Erro ao salvar a Função do Usuário: {0}

# UserRoleDetailsViewModel_ErrorDeletingUserRole0
source: Error deleting User Role: {0}
pt_br: Erro ao excluir a Função de Usuário: {0}

# StudentListViewModel_ErrorLoadingStudents0
source: Error loading Students: {0}
pt_br: Erro ao carregar Alunos: {0}

# StudentListViewModel_ErrorDeleting0Students1
source: Error deleting {0} Students: {1}
pt_br: Erro ao excluir {0} Alunos: {1}

# StudentDetailsViewModel_ErrorDeletingStudent0
source: Error deleting Student: {0}
pt_br: Erro ao excluir Aluno: {0}

# StudentDetailsViewModel_ErrorSavingStudent0
source: Error saving Student: {0}
pt_br: Erro ao salvar Aluno: {0}

# ClassroomDetailsViewModel_ErrorSavingClassroom0
source: Error saving Classroom: {0}
pt_br: Erro ao salvar Sala de Aula: {0}

# ClassroomDetailsViewModel_ErrorDeletingClassroom0
source: Error deleting Classroom: {0}
pt_br: Erro ao excluir Sala de Aula: {0}

# ClassroomListViewModel_ErrorLoadingClassrooms0
source: Error loading Classrooms: {0}
pt_br: Erro ao carregar Salas de Aula: {0}

# ClassroomListViewModel_ErrorDeleting0Classrooms1
source: Error deleting {0} Classrooms: {1}
pt_br: Erro ao excluir {0} Salas de Aula: {1}

# ClassroomStudentDetailsViewModel_ErrorSavingStudentInTheClassroom0
source: Error saving Student in the Classroom: {0}
pt_br: Erro ao salvar o Aluno na Sala de Aula: {0}

# ClassroomStudentDetailsViewModel_ErrorDeletingStudentFromTheClassroom0
source: Error deleting Student from the Classroom: {0}
pt_br: Erro ao excluir Aluno na Sala de Aula: {0}

# ClassroomStudentListViewModel_ErrorLoadingStudentsInTheClassroom0
source: Error loading Students in the Classroom: {0}
pt_br: Erro ao carregar Alunos da Sala de Aula: {0}

# ClassroomStudentListViewModel_ErrorDeleting0StudentsFromTheClassroom1
source: Error deleting {0} Students from the Classroom: {1}
pt_br: Erro ao excluir {0} Alunos da Sala de Aula: {1}

# RelativeDetailsViewModel_ErrorSavingRelative0
source: Error saving Relative: {0}
pt_br: Erro ao salvar Parente: {0}

# RelativeDetailsViewModel_ErrorDeletingRelative0
source: Error deleting Relative: {0}
pt_br: Erro ao excluir Parente: {0}

# RelativeListViewModel_ErrorLoadingRelatives0
source: Error loading Relatives: {0}
pt_br: Erro ao carregar Parentes: {0}

# RelativeListViewModel_ErrorDeleting0Relatives1
source: Error deleting {0} Relatives: {1}
pt_br: Erro ao excluir {0} Parentes: {1}

# StudentRelativeDetailsViewModel_ErrorSavingStudentsRelative0
source: Error saving Student's Relative: {0}
pt_br: Erro ao salvar Parente do Aluno: {0}

# StudentRelativeDetailsViewModel_ErrorDeletingStudentsRelative0
source: Error deleting Student's Relative: {0}
pt_br: Erro ao excluir Parente do Aluno: {0}

# StudentRelativeListViewModel_ErrorLoadingStudentsRelatives0
source: Error loading Student's Relatives: {0}
pt_br: Erro ao carregar Parentes do Aluno: {0}

# StudentRelativeListViewModel_ErrorDeleting0RelativesOfTheStudent1
source: Error deleting {0} Relatives of the Student: {1}
pt_br: Erro ao excluir {0} Parentes do Aluno: {1}

# DismissibleStudentListViewModel_ErrorLoadingDismissibleStudents0
source: Error loading Dismissible Students: {0}
pt_br: Erro ao carregar Alunos Dispensáveis: {0}

# DismissalDetailsViewModel_ErrorSavingDismissal0
source: Error saving Dismissal: {0}
pt_br: Erro ao salvar Dispensa: {0}

# DismissalListViewModel_ErrorLoadingDismissals0
source: Error loading Dismissals: {0}
pt_br: Erro ao carregar Dispensas: {0}

# DismissalListViewModel_ErrorApproving0Dismissals1
source: Error approving {0} Dismissals: {1}
pt_br: Erro ao aprovar {0} Dispensas: {1}

# CompanyDetailsViewModel_ErrorSavingCompany0
source: Error saving Company: {0}
pt_br: Erro ao salvar Empresa: {0}

# CompanyDetailsViewModel_ErrorDeletingCompany0
source: Error deleting Company: {0}
pt_br: Erro ao excluir Empresa: {0}

# CompanyListViewModel_ErrorLoadingCompanies0
source: Error loading Companies: {0}
pt_br: Erro ao carregar Empresas: {0}

# CompanyListViewModel_ErrorDeleting0Companies1
source: Error deleting {0} Companies: {1}
pt_br: Erro ao excluir {0} Empresas: {1}

# CompanyUserListViewModel_ErrorLoadingCompanyUsers0
source: Error loading Company Users: {0}
pt_br: Erro ao carregar Usuários da Empresa: {0}

# CompanyUserListViewModel_ErrorDeleting0CompanyUsers1
source: Error deleting {0} Company Users: {1}
pt_br: Erro ao excluir {0} Usuários da Empresa: {1}

# CompanyUserDetailsViewModel_ErrorSavingCompanyUser0
source: Error saving Company User: {0}
pt_br: Erro ao salvar Usuário da Empresa: {0}

# CompanyUserDetailsViewModel_ErrorDeletingCompanyUser0
source: Error deleting Company User: {0}
pt_br: Erro ao excluir Usuário da Empresa: {0}

# SubscriptionDetailsViewModel_ErrorSavingSubscription0
source: Error saving Subscription: {0}
pt_br: Erro ao salvar Assinatura: {0}

# SubscriptionDetailsViewModel_ErrorDeletingSubscription0
source: Error deleting Subscription: {0}
pt_br: Erro ao excluir Assinatura: {0}

# SubscriptionListViewModel_ErrorLoadingSubscriptions0
source: Error loading Subscriptions:{0}
pt_br: Erro ao carregar Assinaturas: {0}

# SubscriptionListViewModel_ErrorDeleting0Subscriptions1
source: Error deleting {0} Subscriptions: {1}
pt_br: Erro ao excluir {0} Assinaturas: {1}

# LicenseActivationViewModel_PleaseCheckYourConnectionAndTryAgain
source: Please check your connection and try again.
pt_br: Por favor, verifique sua conexão e tente novamente.

# FoundationAPI_SubscriptionService_LicenseKeyIsRequired
source: License key is required.
pt_br: A chave de licença é necessária.

# FoundationAPI_SubscriptionService_InvalidLicenseKey
source: Invalid license key.
pt_br: Chave de licença inválida.

# LoginService_LoginError
source: Login error
pt_br: Erro de login

# LoginService_PleaseEnterValidUsernameAndPassword
source: Please, enter a valid username and password.
pt_br: Por favor, insira um nome de usuário e senha válidos.

# LoginService_CannotSignInWithWindowsHello
source: Cannot sign in with Windows Hello:
pt_br: Não é possível entrar com Windows Hello:

# LoginService_WindowsHelloIsNotEnabledForCurrentUser
source: Windows Hello is not enabled for current user.
pt_br: O Windows Hello não está ativado para o usuário atual.

# LoginService_ToProceedWindowsHelloNeedsToBeConfiguredInWindowsSettings
source: To proceed, Windows Hello needs to be configured in Windows Settings (Accounts -> Sign-in options)
pt_br: Para prosseguir, o Windows Hello precisa ser configurado nas Configurações do Windows (Contas -> Opções de entrada)

# LoginService_TheKeyCredentialCouldNotBeCreatedPleaseTryAgain
source: The key credential could not be created. Please try again.
pt_br: A credencial da chave não pôde ser criada. Por favor, tente novamente.

# LoginService_WindowsHelloError
source: Windows Hello Error
pt_br: Erro do Windows Hello

# LoginViewModel_LoginError
source: Login error
pt_br: Erro de login

# LoginViewModel_PleaseEnterValidUsername
source: Please, enter a valid user name.
pt_br: Por favor, insira um nome de usuário válido.

# LoginViewModel_PleaseEnterValidPassword
source: Please, enter a valid password.
pt_br: Por favor, insira uma senha válida.

# LicenseActivationViewModel_NoInternetConnection
source: No internet connection.
pt_br: Sem conexão com a internet.

# FoundationAPI_SubscriptionService_ActivationFailed
source: Activation Failed.
pt_br: Falha na Ativação.

source: Deletion Failed.
pt_br: Falha na Exclusão.

source: Save Failed.
pt_br: Falha ao Salvar.

source: Load Failed.
pt_br: Falha ao Carregar.

# AppLogListViewModel_ErrorLoadingLogs0
source: Error loading Logs: {0}
pt_br: Erro ao carregar Logs: {0}

source: Approval Failed.
pt_br: Falha na Aprovação.

# StudentBelongingDetailsViewModel_ErrorSavingStudentsBelonging0
source: Error saving Student's Belonging: {0}
pt_br: Erro ao salvar Pertence do Aluno: {0}

# StudentBelongingDetailsViewModel_ErrorDeletingStudentsBelonging0
source: Error deleting Student's Belonging: {0}
pt_br: Erro ao excluir Pertence do Aluno: {0}

# StudentBelongingListViewModel_ErrorLoadingStudentBelongings0
source: Error loading Student Belongings: {0}
pt_br: Erro ao carregar Pertences do Aluno: {0}

# StudentBelongingListViewModel_ErrorDeleting0StudentBelongings1
source: Error deleting {0} Student Belongings: {1}
pt_br: Erro ao excluir {0} Pertences do Aluno: {1}

# LostAndFoundDetailsViewModel_ErrorSavingLostAndFound0
source: Error saving Lost and Found: {0}
pt_br: Erro ao salvar Achados e Perdidos: {0}

# LostAndFoundDetailsViewModel_ErrorDeletingLostAndFound0
source: Error deleting Lost and Found: {0}
pt_br: Erro ao excluir Achados e Perdidos: {0}

# LostAndFoundListViewModel_ErrorLoadingLostAndFound0
source: Error loading Lost and Found: {0}
pt_br: Erro ao carregar Achados e Perdidos: {0}

# LostAndFoundListViewModel_ErrorDeleting0LostAndFound1
source: Error deleting {0} Lost and Found: {1}
pt_br: Erro ao excluir {0} Achados e Perdidos: {1}

# SettingsViewModel_CouldNotCompleteTheSmartSearchSetupPleaseTryAgainLater
source: Could not complete the smart search setup. Please try again later.
pt_br: Não foi possível concluir a preparação da busca inteligente. Tente novamente mais tarde.

source: Process Failed.
pt_br: Processo Falhou.

# LoginViewModel_AccessDenied
source: Access denied
pt_br: Acesso negado

# LoginViewModel_NoAccessibleFeatures
source: Your user account does not have permission to access any system features.
pt_br: Seu usuário não possui permissão para acessar nenhum recurso do sistema.
